{"data":[{"attributes":{"teaser_text":"This week on Firelink, we're discussing our plans for Second Wind in 2024, along with what games we're personally looking forward to playing","title":"[AD-FREE] The Year Ahead | Firelink Podcast","url":"https://www.patreon.com/posts/ad-free-year-95930142"},"id":"95930142","type":"post"},{"attributes":{"content":"<p>The next episode of Design Delve is now available!</p>","teaser_text":"The next episode of Design Delve is now available!","title":"Can a Badly Designed Game Still be Good? | Design Delve","url":"https://www.patreon.com/posts/can-badly-game-95929969"},"id":"95929969","type":"post"},{"attributes":{"teaser_text":"  James Wan’s Aquaman and the Lost Kingdom ends the DC Extended Universe (the DCEU) not with a bang, but with a dated Iron Man reference. Af","title":"[COLUMN] In Its Final Moments, the DCEU Caught Up to Marvel's Starting Point | by Darren Mooney","url":"https://www.patreon.com/posts/column-in-its-up-95924680"},"id":"95924680","type":"post"},{"attributes":{"content":"<p>What a great way to start the year as we've passed the 400,000 subscriber milestone!<br><br>In the next few weeks we'll premiere a brand-new show called Chronicle, voiced and written by Sebastian Ruiz (Frost)! If you enjoyed The Stuff of Legends back at The Escapist, you will love this updated take on that.<br><br>We're also working on bringing over Javed Sterritt's 'Good Blood' series to Second Wind, with the first episode of that dropping this month as well.<br><br>As a reminder, we've now turned on annual memberships and a TON of you have already signed up which is great to see and helping us build out that warchest even faster before we start taking salaries in February.</p><p>Thank you for that!</p><p>New Design Delve remaster dropping tomorrow and Adventure is Nigh on Saturday, plus more streams! Hope you're enjoying it all.</p>","teaser_text":"What a great way to start the year as we've passed the 400,000 subscriber milestone!  In the next few weeks we'll premiere a brand-new show ","title":"400,000 Subscribers!","url":"https://www.patreon.com/posts/400-000-95896535"},"id":"95896535","type":"post"},{"attributes":{"content":"<p>Hey folks!<br><br>A lot of people were requesting annual memberships when we launched and Patreon has finally activated it for us!<br><br>In addition, signing up to an annual membership option gets you a 10% discount on whatever tier you join.</p><p>Since a few have asked about us getting less money from annual memberships - when you sign-up for an annual membership we get paid upfront, so not anything you need to worry about on our end!<br><br>If you have any other questions do let us know and as always, thank you very much for your support!</p>","teaser_text":"Hey folks!  A lot of people were requesting annual memberships when we launched and Patreon has finally activated it for us!  In addition, s","title":"Annual Memberships Now Available!","url":"https://www.patreon.com/posts/annual-now-95808151"},"id":"95808151","type":"post"},{"attributes":{"content":"<p>This week's episode of Fully Ramblomatic is now available!<br><br>Reminder too that Yahtzee Tries livestreams will primarily be on the livestream channel going forward! <a href=\"https://www.youtube.com/live/tm3AXWyf6JA?si=EbrzNB0Z6nA3QY0v\" rel=\"nofollow noopener\" target=\"_blank\">https://www.youtube.com/live/tm3AXWyf6JA?si=EbrzNB0Z6nA3QY0v</a></p>","teaser_text":"This week's episode of Fully Ramblomatic is now available!  Reminder too that Yahtzee Tries livestreams will primarily be on the livestream ","title":"The Best, Worst and Blandest of 2023 | Fully Ramblomatic","url":"https://www.patreon.com/posts/best-worst-and-95799845"},"id":"95799845","type":"post"},{"attributes":{"teaser_text":"Hey folks!  Here's this Discount code for merch this month!","title":"Merch Discount Code","url":"https://www.patreon.com/posts/merch-discount-95798093"},"id":"95798093","type":"post"},{"attributes":{"content":"<p><img data-media-id=\"261848646\" src=\"https://c10.patreonusercontent.com/4/patreon-media/p/post/95795756/12acfaddc08a4d6d8efa38eb085a6d65/eyJ3ZWJwIjowfQ%3D%3D/1.jpg?token-time=1705795200&token-hash=QTTgaIX3-B25t7_42TO4nSYc5nO4RKGm9F3ErXjwe0E%3D\"></p><p>Hey folks!  </p><p>Our next merch run is now available with new limited-run designs, hoodies, hats, sweatshirts and premium t-shirts!  Hope you like the new designs!  Things like pins, plushies, stickers and more are on the way. Expect those later this spring along with a few other neat surprises!<br><br>Check it all out via our store on Shark Robot! <a href=\"https://sharkrobot.com/collections/second-wind?page=1\" rel=\"nofollow noopener\" target=\"_blank\">Second Wind Store – Shark Robot</a></p><p><img data-media-id=\"261848878\" src=\"https://c10.patreonusercontent.com/4/patreon-media/p/post/95795756/d10611ef0b044e9b815474cf2e9564a8/eyJ3ZWJwIjowfQ%3D%3D/1.jpg?token-time=1705795200&token-hash=m2ji_Qr3SAxk25FpF7FnXfJIBL5E1wmg-4N9CqSWV38%3D\"></p><p><img data-media-id=\"261848913\" src=\"https://c10.patreonusercontent.com/4/patreon-media/p/post/95795756/df590e3bb7db4c21a55b711fd3addd8f/eyJ3ZWJwIjowfQ%3D%3D/1.jpg?token-time=1705795200&token-hash=vWhARUrJhhFNTZ1rcJ-YSjqI2B4cKDzo-08JR_flin4%3D\"></p><p><br></p>","teaser_text":"  Hey folks!   Our next merch run is now available with new limited-run designs, hoodies, hats, sweatshirts and premium t-shirts!  Hope you ","title":"New Merch Available Now!","url":"https://www.patreon.com/posts/new-merch-now-95795756"},"id":"95795756","type":"post"},{"attributes":{"content":"<p><img data-media-id=\"261537268\" src=\"https://c10.patreonusercontent.com/4/patreon-media/p/post/95738429/10b94c2e3197400495786ee8f721e74a/eyJ3Ijo4MjB9/1.png?token-time=1705795200&token-hash=JubPMp9OiDdYAw41QAthyHAToz3WNz2cC1_MdUl7XcY%3D\"></p><p>Very happy to share our updated revenue report for Second Wind for the end of year 2023!</p><p>We've had a really strong start and are making good on building a solid warchest for when we start paying ourselves in February.</p><p>Thank you for all your support thus far!</p><p>As we start the year, we'll be making another big push for Patreon support to make sure we have a buffer zone for staying at our target funding, and we're rethinking Kickstarter a bit towards more of a fundraising event instead.  We'll have more details soon on that!</p><p>In March we'll also be doing a big Charity event stream as well to do something to give back for all the support we've been receiving.</p><p>For Jan - February we'll be launching new shows, getting our reg stream schedule going, contracts for employees and other business items!</p><p><br></p><p>Thank you,<br><br><strong>Nick Calandra</strong><br>Editor in Chief</p>","teaser_text":"  Very happy to share our updated revenue report for Second Wind for the end of year 2023! We've had a really strong start and are making go","title":"Second Wind - End of Year 2023 Revenue Report","url":"https://www.patreon.com/posts/second-wind-end-95738429"},"id":"95738429","type":"post"},{"attributes":{"content":"<p>Happy New Year! <br><br>Our first video of the new year is now available taking a look at video game preservation with Frost!</p>","teaser_text":"Happy New Year!   Our first video of the new year is now available taking a look at video game preservation with Frost!","title":"The Preservation Paradox | Cold Take","url":"https://www.patreon.com/posts/preservation-95667649"},"id":"95667649","type":"post"},{"attributes":{"teaser_text":"  Hey folks!  Here's your art print from El Cheshire for December!   Thanks so much for supporting us in 2023 and we're coming back with vid","title":"December Art Print from El Cheshire!","url":"https://www.patreon.com/posts/december-art-el-95665331"},"id":"95665331","type":"post"},{"attributes":{"teaser_text":"  The Zone of Interest begins and ends with nothing. The film opens on a white screen that shifts to a black screen. It is a minute before a","title":"[COLUMN] The Zone of Interest Understands That Not Looking Is a Choice | by Darren Mooney","url":"https://www.patreon.com/posts/column-zone-of-95488144"},"id":"95488144","type":"post"},{"attributes":{"teaser_text":"  Anatomy of a Fall begins with an interview. Author Sandra Voyter (Sandra Hüller) is being interviewed by a young postgraduate student, Zoé","title":"[COLUMN] Anatomy of a Fall Is a Portrait of an Artist Under Fire | by Darren Mooney","url":"https://www.patreon.com/posts/column-anatomy-95372220"},"id":"95372220","type":"post"},{"attributes":{"content":"<p>Happy Holidays! <br><br>A new episode of Bytesized is now available from KC Nwosu checking out Sanabi! </p>","teaser_text":"Happy Holidays!   A new episode of Bytesized is now available from KC Nwosu checking out Sanabi! ","title":"Sanabi is Yet Another Argument for Grappling Hook Supremacy | Bytesized","url":"https://www.patreon.com/posts/sanabi-is-yet-95319830"},"id":"95319830","type":"post"},{"attributes":{"content":"<p>Wanted to take a moment before the team closes up shop for the holidays to thank everyone for the crazy amount of support that was shown towards myself and the Second Wind team over the last few weeks. Having The Escapist ripped out from under us was terrifying and I’ve only just gotten to process it.</p><p>I put an unhealthy amount of my time and life into rebuilding that brand. It was the thing I was most proud of in my life at the time, and so getting tossed to the wind after all that work… well, it took over a month to let those emotions out is what I’ll say on that.</p><p>But with Second Wind now underway, the team and I couldn’t be happier with how things have turned out.</p><p>The amount of support has been unexpected and incredible, and knowing how differently this all could have gone means none of us will ever take this opportunity for granted.</p><p>To my team that either got fired or followed me out the door - thank you for sticking by me and believing in not only me, but each other that we can do this. We built something special together, and I’m thankful every day that we’re getting the opportunity to continue that.</p><p>To everyone that has supported us monetarily, shared our work, or just left us a message of support. Thank you.</p><p>The past month has been stressful obviously, but your excitement and encouragement has far outweighed the stress and pushed us forward.</p><p>We’re taking the 23rd of December - 1st of January off, but we’re excited to get 2024 started! We have a few more videos scheduled to go out during break, but for the most part we are pencils down!</p><p>Thank you for believing in us and putting your support in us to give us our second wind.</p><p><br></p><p>Cheers!</p><p><strong>Nick Calandra</strong></p><p>Editor-in-Chief of Second Wind </p>","teaser_text":"Wanted to take a moment before the team closes up shop for the holidays to thank everyone for the crazy amount of support that was shown tow","title":"Before We Go on Break... Thank You!","url":"https://www.patreon.com/posts/before-we-go-on-95133469"},"id":"95133469","type":"post"},{"attributes":{"teaser_text":"  At one point in James Wan’s Aquaman, the villainous Black Manta (Yahya Abdul-Mateen II) spots Arthur Curry (Jason Momoa) and Mera (Amber H","title":"[COLUMN] Aquaman Reimagines Lovecraftian Horror as Triumphant Spectacle | by Darren Mooney","url":"https://www.patreon.com/posts/column-aquaman-95127946"},"id":"95127946","type":"post"},{"attributes":{"content":"<p>A new episode of Design Delve is out now! <br><br>Enjoy!</p>","teaser_text":"A new episode of Design Delve is out now!   Enjoy!","title":"How to Asset Flip Irresponsibly | Design Delve","url":"https://www.patreon.com/posts/how-to-asset-95119945"},"id":"95119945","type":"post"},{"attributes":{"content":"<p>Rachel Watts explores In Stars and Time and how it perfects the video game time loop.</p>","teaser_text":"Rachel Watts explores In Stars and Time and how it perfects the video game time loop.","title":"How In Stars and Time Perfects the Video Game Time Loop | Bytesized","url":"https://www.patreon.com/posts/how-in-stars-and-95073164"},"id":"95073164","type":"post"},{"attributes":{"content":"<p>A new episode of Semi-Ramblomatic is out now! <br><br>Spoilers ahead for American Arcadia if you haven't played it yet.</p>","teaser_text":"A new episode of Semi-Ramblomatic is out now!   Spoilers ahead for American Arcadia if you haven't played it yet.","title":"The Importance of an Ending | Semi-Ramblomatic","url":"https://www.patreon.com/posts/importance-of-95064559"},"id":"95064559","type":"post"},{"attributes":{"teaser_text":"On this week’s episode of Windbreaker, Yahtzee, Frost, and Marty chat about what they want to see from gaming in 2024, from trends to die ou","title":"[AD-FREE] Let's Fix Games in 2024 | Windbreaker Podcast","url":"https://www.patreon.com/posts/ad-free-lets-fix-95024952"},"id":"95024952","type":"post"}],"links":{"next":"https://www.patreon.com/api/posts?fields%5Bpost%5D=title%2Curl%2Cteaser_text%2Ccontent&filter%5Bcampaign_id%5D=11307698&filter%5Bcontains_exclusive_posts%5D=true&filter%5Bis_draft%5D=false&sort=-published_at&json-api-version=1.0&json-api-use-default-includes=false&page%5Bcursor%5D=021rW9luwEBpHaD8PCw3iPiwAl"},"meta":{"pagination":{"cursors":{"next":"021rW9luwEBpHaD8PCw3iPiwAl"},"total":91}}}
